# 1.列表是一个类的类型数据
# 代码 for example:
a = [1, 12.56, "字符串"]
print(type(a))  # <class 'list'>
print("\n")

# 2.取出列表中的值编号为0开始
a = [1, 12.56, "字符串"]
b = a[1]
print(b)  # 第二个元素为12.56
print("\n")

# 3.列表切片有正向和有逆向,且取出集合不包含右边对应的值
# 切片方法使用的时候格式[x:y], 再在元组切片时格式依然如此
# 正向
a = [1, 12.56, "字符串"]
b = a[0:2]
print(b)

# 逆向
a = [1, 12.56, "字符串"]
b = a[-3:-1]  # -3开始取，只能取到-2，最后一个python语言定义为-1
print(b)
print("\n")

# 4.添加与删除元素
x = ['123']

y = 'xxx'
x.append("chc")  # （增补在末尾）
x.append("xxx")  # （增补在末尾）
x.remove(y)  # （已知列表值=’xxx‘删除方式）
y = 0
del x[y]  # （索引值删除方式）

z = x.pop(y)  # （索引值删除方式:删除第0个，且将它赋值给z）
print("x:", x)
print("z:", z)

# 列表之间的相加
# 指定索引值插入元素，元素可以是各种数据类型
a = [1, 12.56, '字符串']
b = [100, 1000]
c = a + b
print(c)
a.insert(2, b)
print(a)
print("\n")

# 列表长度获取
# 下列代码表示先取出a列表的长度，并且增加到索引值为1的位置，再输出
a = [1, 12.56, '字符串']
b = len(a)
a.insert(1, b)
print(a)
